org/linux/2015-01-07-GNU-Parallel.org
#+HUGO_BASE_DIR: ../../hugo
#+HUGO_SECTION: Linux
#+HUGO_CATEGORIES: Linux
#+HUGO_TYPE: post
#+TITLE: Zip folders with GNU Parallel
#+DATE: <2015-01-07 Wed>
#+AUTHOR: Dominik Schrempf
#+EMAIL: dominik.schrempf@gmail.com
#+DESCRIPTION: How to zip folders in parallel
#+KEYWORDS: "GNU Parallel" Parallel Tar Zip
#+LANGUAGE: en

Working with large files takes a long time. Sometimes, it is worth to zip
folders individually, so that a single archive does not get too large. [[http://www.gnu.org/s/parallel][GNU
Parallel]] is a shell tool to execute jobs in parallel. Here, I show one of
possibly many methods to use it to zip many folders (or files) in parallel.

1. Create a file with all folders that you want to zip, e.g with:
#+begin_src sh
ls -1 > folders
#+end_src

2. Use GNU Parallel to zip them:
#+begin_src sh
parallel -a folders "tar -czf {}.tar.gz {}"
#+end_src

In order to unzip many files at ones (this method can also be used to
zip the files if their names follow certain patterns):
#+begin_src sh
parallel "tar -xzf {}" ::: *.tar.gz
#+end_src
