posts/Linux/2015-01-07-GNU-Parallel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-10 Sat 17:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Zip folders with GNU Parallel</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="How to zip folders in parallel."
 />
<meta name="keywords" content="GNU Parallel, Parallel, Tar, Zip" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Zip folders with GNU Parallel</h1>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-01-07 Wed&gt; </span></span> Working with large files takes a long time.
Sometimes, it is worth to zip folders individually, so that a single
archive does not get too large.  <a href="http://www.gnu.org/s/parallel">GNU Parallel</a> is a shell tool to
execute jobs in parallel.  Here, I show one of possibly many methods
to use it to zip many folders (or files) in parallel.
</p>

<ol class="org-ol">
<li>Create a file with all folders that you want to zip, e.g with:</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">ls -1 &gt; folders
</pre>
</div>

<ol class="org-ol">
<li>Use GNU Parallel to zip them:</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">parallel -a folders <span style="color: #2d9574;">"tar -czf {}.tar.gz {}"</span>
</pre>
</div>

<p>
In order to unzip many files at ones (this method can also be used to
zip the files if their names follow certain patterns):
</p>
<div class="org-src-container">
<pre class="src src-sh">parallel <span style="color: #2d9574;">"tar -xzf {}"</span> ::: *.tar.gz
</pre>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(Zip folders with GNU Parallel)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><p>Copyright 2015-2018 Dominik Schrempf</p>
<p>Last updated <span class="timestamp-wrapper"><span class="timestamp">2018-02-10</span></span></p>
<p>Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="https://orgmode.org">Org</a> mode 9.1.6) </p>
<p><a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML</p>
</div>
</div>
</body>
</html>
